.src/FrontEnd/l_bootstrap.org
#+TITLE: Bootstrap



* 基本使用

首先，要引进 (本地或 cdn):
#+begin_src html
  <!-- 提供基本的样式、布局、组件 -->
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/css/bootstrap.min.css">

  <!-- 提供额外的，跟交互有关的组件功能，弹出层、tab 页切换 -->
  <script src="https://cdn.jsdelivr.net/npm/jquery@1.12.4/dist/jquery.min.js"></script>
  <script src="https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/js/bootstrap.min.js"></script>
#+end_src

* 网格布局

#+begin_src html
  <!doctype html>
  <html lang="en">
    <head>
      <meta charset="UTF-8"/>
      <title>网格布局</title>
      <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/css/bootstrap.min.css">
      <style>
       ,* {
         box-sizing: border-box;
       }

       p {
         color: white;
         background: black;
         font-weight: bold;
         height: 50px;
         border: 1px solid red;
       }
       .left-side, .main, .ad {
         border: 1px solid grey;
         height: 300px;
       }
       .logo {
         height: 150px;
         background: grey;
       }
      </style>
    </head>
    <body>
      <div class="container">
        <header class="logo row">
          我的博客系统
        </header>
        <div class="row">
          <div class="left-side col-md-2">
            菜单之类
          </div>
          <div class="main col-md-8">
            <div class="row">
              <p class="col-md-1">11111</p>
              <p class="col-md-1">22222</p>
              <p class="col-md-1">33333</p>
              <p class="col-md-1">44444</p>
            </div>
            <div class="row">
              <p class="col-md-1">11111</p>
              <p class="col-md-2">22222</p>
              <p class="col-md-2">33333</p>
              <p class="col-md-1">44444</p>
            </div>
            <div class="row">
              <p class="col-md-1">11111</p>
              <p class="col-md-5">22222</p>
              <p class="col-md-5">33333</p>
              <p class="col-md-1">44444</p>
            </div>
            <div class="row">
              <p class="col-md-3">11111</p>
              <p class="col-md-3">22222</p>
              <p class="col-md-3">33333</p>
              <p class="col-md-3">44444</p>
            </div>
          </div>
          <div class="ad col-md-2">
            广告之类
          </div>
        </div>
      </div>
    </body>
  </html>

#+end_src

* 响应式布局

pass

* 组件

pass

* 应用

pass
