bk_html/FrontEnd/l_bootstrap.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Bootstrap</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">Bootstrap</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7fa6459">1. 基本使用</a></li>
<li><a href="#org1df670e">2. 网格布局</a></li>
<li><a href="#orgfd81e20">3. 响应式布局</a></li>
<li><a href="#org442cda1">4. 组件</a></li>
<li><a href="#orgcd07d8a">5. 应用</a></li>
</ul>
</div>
</nav>



<section id="outline-container-org7fa6459" class="outline-2">
<h2 id="org7fa6459"><span class="section-number-2">1</span> 基本使用</h2>
<div class="outline-text-2" id="text-1">
<p>
首先，要引进 (本地或 cdn):
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #687080; font-style: italic;">&lt;!-- </span><span style="color: #687080; font-style: italic;">&#25552;&#20379;&#22522;&#26412;&#30340;&#26679;&#24335;&#12289;&#24067;&#23616;&#12289;&#32452;&#20214; </span><span style="color: #687080; font-style: italic;">--&gt;</span>
<span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">link</span> <span style="color: #61afef;">rel</span>=<span style="color: #98be65;">"stylesheet"</span> <span style="color: #61afef;">href</span>=<span style="color: #98be65;">"https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/css/bootstrap.min.css"</span><span style="color: #8c8c8c;">&gt;</span>

<span style="color: #687080; font-style: italic;">&lt;!-- </span><span style="color: #687080; font-style: italic;">&#25552;&#20379;&#39069;&#22806;&#30340;&#65292;&#36319;&#20132;&#20114;&#26377;&#20851;&#30340;&#32452;&#20214;&#21151;&#33021;&#65292;&#24377;&#20986;&#23618;&#12289;tab &#39029;&#20999;&#25442; </span><span style="color: #687080; font-style: italic;">--&gt;</span>
<span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">script</span> <span style="color: #61afef;">src</span>=<span style="color: #98be65;">"https://cdn.jsdelivr.net/npm/jquery@1.12.4/dist/jquery.min.js"</span><span style="color: #8c8c8c;">&gt;&lt;</span>/<span style="color: #61afef;">script</span><span style="color: #8c8c8c;">&gt;</span>
<span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">script</span> <span style="color: #61afef;">src</span>=<span style="color: #98be65;">"https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/js/bootstrap.min.js"</span><span style="color: #8c8c8c;">&gt;&lt;</span>/<span style="color: #61afef;">script</span><span style="color: #8c8c8c;">&gt;</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-org1df670e" class="outline-2">
<h2 id="org1df670e"><span class="section-number-2">2</span> 网格布局</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #c678dd; font-weight: bold;">!doctype</span> html&gt;
<span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">html</span> <span style="color: #61afef;">lang</span>=<span style="color: #98be65;">"en"</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">head</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">meta</span> <span style="color: #61afef;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>/<span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">title</span><span style="color: #8c8c8c;">&gt;</span><span style="font-weight: bold; text-decoration: underline;">&#32593;&#26684;&#24067;&#23616;</span><span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">title</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">link</span> <span style="color: #61afef;">rel</span>=<span style="color: #98be65;">"stylesheet"</span> <span style="color: #61afef;">href</span>=<span style="color: #98be65;">"https://cdn.jsdelivr.net/npm/bootstrap@3.3.7/dist/css/bootstrap.min.css"</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">style</span><span style="color: #8c8c8c;">&gt;</span>
     <span style="color: #61afef;">* </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">box-sizing</span>: border-box;
     <span style="color: #8c8c8c;">}</span>

     <span style="color: #61afef;">p </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">color</span>: <span style="color: #000000; background-color: #ffffff;">white</span>;
       <span style="color: #c678dd; font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>;
       <span style="color: #c678dd; font-weight: bold;">font-weight</span>: bold;
       <span style="color: #c678dd; font-weight: bold;">height</span>: 50px;
       <span style="color: #c678dd; font-weight: bold;">border</span>: 1px solid <span style="color: #ffffff; background-color: #ff0000;">red</span>;
     <span style="color: #8c8c8c;">}</span>
     <span style="color: #61afef;">.left-side, .main, .ad </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">border</span>: 1px solid <span style="color: #ffffff; background-color: #808080;">grey</span>;
       <span style="color: #c678dd; font-weight: bold;">height</span>: 300px;
     <span style="color: #8c8c8c;">}</span>
     <span style="color: #61afef;">.logo </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">height</span>: 150px;
       <span style="color: #c678dd; font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #808080;">grey</span>;
     <span style="color: #8c8c8c;">}</span>
    <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">style</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">head</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">body</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"container"</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">header</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"logo row"</span><span style="color: #8c8c8c;">&gt;</span>
        &#25105;&#30340;&#21338;&#23458;&#31995;&#32479;
      <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">header</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"row"</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"left-side col-md-2"</span><span style="color: #8c8c8c;">&gt;</span>
          &#33756;&#21333;&#20043;&#31867;
        <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"main col-md-8"</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"row"</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>11111<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>22222<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>33333<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>44444<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"row"</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>11111<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-2"</span><span style="color: #8c8c8c;">&gt;</span>22222<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-2"</span><span style="color: #8c8c8c;">&gt;</span>33333<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>44444<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"row"</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>11111<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-5"</span><span style="color: #8c8c8c;">&gt;</span>22222<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-5"</span><span style="color: #8c8c8c;">&gt;</span>33333<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-1"</span><span style="color: #8c8c8c;">&gt;</span>44444<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"row"</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-3"</span><span style="color: #8c8c8c;">&gt;</span>11111<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-3"</span><span style="color: #8c8c8c;">&gt;</span>22222<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-3"</span><span style="color: #8c8c8c;">&gt;</span>33333<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
            <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">p</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"col-md-3"</span><span style="color: #8c8c8c;">&gt;</span>44444<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">p</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">div</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"ad col-md-2"</span><span style="color: #8c8c8c;">&gt;</span>
          &#24191;&#21578;&#20043;&#31867;
        <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">div</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">body</span><span style="color: #8c8c8c;">&gt;</span>
<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">html</span><span style="color: #8c8c8c;">&gt;</span>

</pre>
</div>
</div>
</section>

<section id="outline-container-orgfd81e20" class="outline-2">
<h2 id="orgfd81e20"><span class="section-number-2">3</span> 响应式布局</h2>
<div class="outline-text-2" id="text-3">
<p>
pass
</p>
</div>
</section>

<section id="outline-container-org442cda1" class="outline-2">
<h2 id="org442cda1"><span class="section-number-2">4</span> 组件</h2>
<div class="outline-text-2" id="text-4">
<p>
pass
</p>
</div>
</section>

<section id="outline-container-orgcd07d8a" class="outline-2">
<h2 id="orgcd07d8a"><span class="section-number-2">5</span> 应用</h2>
<div class="outline-text-2" id="text-5">
<p>
pass
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
